{
  "prid": "2232897",
  "ministry": "Ministry of Railways",
  "title": "Indian Railways Begins to Operate 1,244 Holi Special Train Trips Across Zones to Ensure Smooth and Comfortable Festival Travel",
  "posted_on_raw": "25 FEB 2026 9:45PM",
  "source_url": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2232897",
  "pdfs": [],
  "text": "Press Release:Press Information Bureau\n\n                              Ministry of Railways\n\n                                    Indian Railways Begins to Operate 1,244 Holi Special Train Trips Across Zones to Ensure Smooth and Comfortable Festival Travel\n\nEast Central Railway to Operate Highest Number of Holi Specials with 275 Train Trips\nNorthern Railway to Run 204 Holi Special Train Trips\n\n                              Posted On:\n                25 FEB 2026 9:45PM by PIB Delhi\n\nIndian Railways has made elaborate arrangements to facilitate smooth, safe and comfortable travel for passengers during the upcoming Holi festival. To manage the anticipated surge in passenger traffic, 1244 Holi Special train trips to be operated across various Railway Zones for the Holi period from 25.02.2026 to 18.03.2026\n. The number may increase up to 1500 if more demand is observed.\n\nThese special services will connect major cities, state capitals and important regional centres across the country, ensuring confirmed accommodation and reducing congestion on regular trains.\n\nKey long-distance connections include Mumbai, Pune and Nagpur to destinations such as Danapur, Gorakhpur, Hazrat Nizamuddin, Samastipur and Barauni; Visakhapatnam, Puri and Bhubaneswar to Shalimar, Patna, Yesvantpur and Dhanbad; and major Bihar and Jharkhand hubs like Patna, Darbhanga, Saharsa and Dhanbad to New Delhi, Anand Vihar Terminal, Chandigarh and SMVT Bengaluru.\n\nEastern and Northern corridors will see enhanced connectivity between Howrah, Sealdah, Kolkata and Malda Town with Raxaul, Madhubani, Gorakhpur and Anand Vihar Terminal, while Delhi region stations will be linked extensively with Varanasi, Lucknow, Ayodhya Cantt, Haridwar, Amritsar and Katihar.\n\nFrom the South, special services will connect MGR Chennai Central, Ernakulam, Thiruvananthapuram North, Coimbatore, Secunderabad, Tirupati and SMVT Bengaluru with Patna, Barauni, Muzaffarpur, Santragachi, Ajmer, Jaipur and other northern and eastern centres. Western India, including Mumbai Central, Ahmedabad, Vadodara, Surat and Bandra Terminus, will have additional links to Kanpur, Katihar, Banaras, Gorakhpur, Darbhanga and Bhagalpur.\n\nCentral Railway\n\nWith the objective of providing smooth, safe and comfortable travel during the Holi festival, Central Railway will operate several Holi Special trains from major stations including Mumbai (CSMT & Lokmanya Tilak Terminus), Pune and Nagpur to key destinations across North and East India. Central Railway to run 20 Holi Special Train Services with 129 trips which are as follows:\n\nTrain No. 01469/01470 Pune–Nagpur–Pune Holi Special will operate between 25.02.2026 and 05.03.2026 with notified trips on Wednesdays and Thursdays.\n\nTrain No. 01073/01074 Lokmanya Tilak Terminus–Banaras–Lokmanya Tilak Terminus Holi Special will run between 25.02.2026 and 07.03.2026 on notified weekdays.\n\nTrain No. 01481/01482 Pune–Danapur–Pune Holi Special will operate between 27.02.2026 and 08.03.2026 on Mondays and Fridays (outward) and Wednesdays and Sundays (return).\n\nTrain No. 01431/01432 Pune–Ghazipur City–Pune Holi Special will run between 24.02.2026 and 08.03.2026 on notified weekly frequencies.\n\nTrain No. 01043/01044 Lokmanya Tilak Terminus–Samastipur–Lokmanya Tilak Terminus Holi Special will operate between 26.02.2026 and 05.03.2026.\n\nTrain No. 01491/01492 Pune–Hazrat Nizamuddin–Pune Holi Special will run between 27.02.2026 and 07.03.2026.\n\nTrain No. 01079/01080 CSMT–Gorakhpur–CSMT Holi Special will operate daily from 25.02.2026 to 08.03.2026.\n\nTrain No. 01415/01416 Pune–Gorakhpur–Pune Holi Special will also run daily between 25.02.2026 and 08.03.2026.\n\nTrain No. 01143/01144 Lokmanya Tilak Terminus–Danapur–Lokmanya Tilak Terminus Holi Special will operate daily during the notified period.\n\nTrain No. 01449/01450 Pune–Danapur–Pune Holi Special will also run daily from 25.02.2026 to 08.03.2026.\n\nEast Coast Railway\n\nEast Coast Railway will operate Holi Special trains from Visakhapatnam, Puri and Bhubaneswar towards Eastern and Southern destinations. East Coast Railway to run 8 Holi Special Train Services with 62 trips which are as follows:\n\nTrain No. 08507/08508 Visakhapatnam–Shalimar–Visakhapatnam Holi Special will operate between 03.03.2026 and 18.03.2026.\n\nTrain No. 08439/08440 Puri–Patna–Puri Holi Special will run between 28.02.2026 and 15.03.2026.\n\nTrain No. 02811/02812 Bhubaneswar–Yesvantpur–Bhubaneswar Holi Special will operate between 28.02.2026 and 16.03.2026.\n\nTrain No. 02831/02832 Bhubaneswar–Dhanbad–Bhubaneswar Holi Special will run daily from 25.02.2026 to 18.03.2026.\n\nEast Central Railway\n\nEast Central Railway will operate a large number of Holi Special trains connecting Bihar and Jharkhand with Delhi, Mumbai and South India. East Central Railway to run 50 Holi Special Train Services with 275 trips which are as follows:\n\nTrain No. 02563/02564 Barauni–New Delhi–Barauni Holi Special will run daily from 25.02.2026 to 18.03.2026.\n\nTrain No. 02569/02570 Darbhanga–New Delhi–Darbhanga Holi Special will also operate daily during the same period.\n\nTrain No. 05575/05576 Saharsa–Anand Vihar Terminal–Saharsa Holi Special will operate between 10.03.2026 and 18.03.2026.\n\nTrain No. 05579/05580 Purnea Court–Anand Vihar Terminal–Purnea Court Holi Special will run between 06.03.2026 and 18.03.2026 on multiple weekly frequencies.\n\nTrain No. 03293/03294 Patna–Old Delhi–Patna Holi Special will operate daily between 05.03.2026 and 16.03.2026.\n\nTrain No. 03697/03698 Sheikhpura–Anand Vihar Terminal–Sheikhpura Holi Special will run between 27.02.2026 and 15.03.2026.\n\nTrain No. 02397/02398 Sheikhpura–Anand Vihar Terminal–Sheikhpura Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 03639/03640 Gaya–Old Delhi–Gaya Holi Special will run between 06.03.2026 and 13.03.2026.\n\nTrain No. 03309/03310 Dhanbad–Old Delhi–Dhanbad Holi Special will operate between 03.03.2026 and 18.03.2026.\n\nTrain No. 03311/03312 Dhanbad–Chandigarh–Dhanbad Holi Special will run between 06.03.2026 and 19.03.2026.\n\nTrain No. 03379/03380 Dhanbad–Lokmanya Tilak Terminus–Dhanbad Holi Special will operate between 10.03.2026 and 19.03.2026.\n\nTrain No. 03677/03678 Dhanbad–Gorakhpur–Dhanbad Holi Special will run between 08.03.2026 and 16.03.2026.\n\nTrain No. 03257/03258 Danapur–Anand Vihar Terminal–Danapur Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 03223/03224 Rajgir–Haridwar–Rajgir Holi Special will run between 06.03.2026 and 14.03.2026.\n\nTrain No. 03221/03222 Rajgir–Anand Vihar Terminal–Rajgir Holi Special will operate between 09.03.2026 and 18.03.2026.\n\nTrain No. 03251/03252 Danapur–SMVT Bengaluru–Danapur Holi Special will run daily between 25.02.2026 and 18.03.2026.\n\nTrain No. 03225/03226 Danapur–Charlapalli–Danapur Holi Special will operate between 05.03.2026 and 15.03.2026.\n\nTrain No. 03253/07855-56 Patna–Charlapalli–Patna Holi Special will run between 09.03.2026 and 16.03.2026.\n\nTrain No. 02023/02024 Patna–Howrah–Patna Holi Special will operate between 08.03.2026 and 15.03.2026.\n\nTrain No. 05557/05558 Raxaul–Lokmanya Tilak Terminus–Raxaul Holi Special will run between 07.03.2026 and 15.03.2026.\n\nTrain No. 05585/05586 Saharsa–Lokmanya Tilak Terminus–Saharsa Holi Special will operate between 10.03.2026 and 19.03.2026.\n\nTrain No. 05219/05220 Muzaffarpur–Anand Vihar Terminal–Muzaffarpur Holi Special will run between 06.03.2026 and 15.03.2026.\n\nEastern Railway\n\nWith the objective of managing Holi festival rush, Eastern Railway will operate several Holi Special trains from Howrah, Sealdah, Kolkata, Malda Town, Dankuni and Asansol towards Bihar, Uttar Pradesh and Delhi region. Eastern Railway to run 22 Holi Special Train Services with 48 trips which are as follows:\n\nTrain No. 03043/03044 Howrah–Raxaul–Howrah Holi Special will operate between 28.02.2026 and 15.03.2026 on notified days.\n\nTrain No. 03045/03046 Howrah–Raxaul–Howrah Holi Special will run between 01.03.2026 and 03.03.2026.\n\nTrain No. 03183/03184 Sealdah–Madhubani–Sealdah Holi Special will operate between 28.02.2026 and 08.03.2026.\n\nTrain No. 03185/03186 & 03187/03188 Kolkata–Madhubani–Kolkata Holi Specials will run between 27.02.2026 and 04.03.2026.\n\nTrain No. 03525/03526 and 03527/03528 Asansol–Gorakhpur–Asansol Holi Specials will operate between 27.02.2026 and 03.03.2026.\n\nTrain No. 03009/03010 Dankuni–Anand Vihar Terminal–Dankuni Holi Special will run between 28.02.2026 and 08.03.2026.\n\nTrain No. 03435/03436 Malda Town–Anand Vihar Terminal–Malda Town Holi Special will operate between 02.03.2026 and 17.03.2026.\n\nTrain No. 03007/03008 Howrah–Kharagpur–Howrah Holi Special will run between 25.02.2026 and 13.03.2026.\n\nTrain No. 03129/03130 Kolkata–New Jalpaiguri–Kolkata Holi Special will operate between 28.02.2026 and 01.03.2026.\n\nTrain No. 03101/03102 Sealdah–Malda Town–Sealdah Holi Special will run between 27.02.2026 and 21.03.2026.\n\nTrain No. 03417/03418 Malda Town–Udhna–Malda Town Holi Special will operate between 28.02.2026 and 23.03.2026.\n\nNorthern Railway\n\nNorthern Railway will operate extensive Holi Special trains connecting Delhi region with Uttar Pradesh, Bihar, Uttarakhand and Punjab. Northern Railway to run 48 Holi Special Train Services with 204 trips which are as follows:\n\nTrain No. 04209/04210 New Delhi–Varanasi–New Delhi Holi Special will operate five days a week between 25.02.2026 and early March.\n\nTrain No. 04213/04214 Ayodhya Cantt–Anand Vihar Terminal–Ayodhya Cantt Holi Special will run tri-weekly.\n\nTrain No. 04227/04228 Varanasi–Chandigarh–Varanasi Holi Special will operate bi-weekly.\n\nTrain No. 04203/04204 Lucknow–New Delhi–Lucknow Holi Special will run weekly.\n\nTrain No. 04052/04051 New Delhi–Howrah–New Delhi Holi Special will operate daily between 25.02.2026 and 08.03.2026.\n\nTrain No. 04014/04013 New Delhi–Barauni–New Delhi Holi Special will run daily during the notified period.\n\nTrain No. 04070/04069 Anand Vihar Terminal–Lucknow–Anand Vihar Holi Special will operate daily.\n\nTrain No. 04060/04059 Anand Vihar Terminal–Saharsa–Anand Vihar Holi Special will run daily between 25.02.2026 and 07.03.2026.\n\nTrain No. 04010/04009 Delhi–Sitamarhi–Delhi Holi Special will operate between 25.02.2026 and 06.03.2026.\n\nTrain No. 04066/04065 Anand Vihar Terminal–Puri–Anand Vihar Holi Special will run daily.\n\nTrain No. 04614/04613 Amritsar–Katihar–Amritsar Holi Special will operate weekly during early March.\n\nTrain No. 04652/04651 Amritsar–Jay Nagar–Amritsar Holi Special will run bi-weekly.\n\nTrain No. 04616/04615 Firozpur Cantt–Danapur–Firozpur Cantt Holi Special will operate weekly.\n\nTrain No. 04610/04609 Amritsar–Mansi–Amritsar Holi Special will run bi-weekly.\n\nTrain No. 04302/04301 Haridwar–Muzaffarpur–Haridwar Holi Special will operate tri-weekly.\n\nTrain No. 04312/04311 Yog Nagari Rishikesh–Kolkata–Yog Nagari Rishikesh Holi Special will run tri-weekly.\n\nTrain No. 04514/04513 Chandigarh–Gorakhpur–Chandigarh Holi Special will operate weekly.\n\nTrain No. 04002/04001 New Delhi–Dadar Western–New Delhi Holi Special will run bi-weekly.\n\nTrain No. 04226/04225 Varanasi–Lokmanya Tilak Terminus–Varanasi Holi Special will operate bi-weekly.\n\nTrain No. 04212/04211 Sultanpur–Lokmanya Tilak Terminus–Sultanpur Holi Special will run bi-weekly.\n\nTrain No. 04414/04413 Hazrat Nizamuddin–Mathura–Hazrat Nizamuddin Holi Special will operate daily.\n\nTrain No. 04412/04411 Tilak Bridge–Bareilly–Tilak Bridge Holi Special will run daily.\n\nNorth Central Railway\n\nWith the objective of managing the additional passenger rush during the Holi festival, North Central Railway has notified several Holi Special train services connecting Uttar Pradesh with Maharashtra and other key destinations. North Central Railway to run 16  Holi Special Train Services with 46 trips which are as follows:\n\nTrain No. 04212 Sultanpur – Lokmanya Tilak Terminus Holi Special will operate on 26.02.2026 and 02.03.2026.\n\nTrain No. 04211 Lokmanya Tilak Terminus – Sultanpur Holi Special will operate on 27.02.2026 and 03.03.2026.\n\nTrain No. 04226 Varanasi – Lokmanya Tilak Terminus Holi Special will operate on 25.02.2026 and 01.03.2026.\n\nTrain No. 04225 Lokmanya Tilak Terminus – Varanasi Holi Special will operate on 26.02.2026 and 02.03.2026.\n\nTrain No. 04203 Lucknow – New Delhi Holi Special will operate on 23.02.2026 and 02.03.2026.\n\nTrain No. 04204 New Delhi – Lucknow Holi Special will operate on 23.02.2026 and 02.03.2026.\n\nTrain No. 04209 Varanasi – Delhi Holi Special will operate between 22.02.2026 and 06.03.2026.\n\nTrain No. 04210 Delhi – Varanasi Holi Special will operate between 23.02.2026 and 07.03.2026.\n\nTrain No. 04227 Varanasi – Chandigarh Holi Special will operate between 21.02.2026 and 28.02.2026.\n\nTrain No. 04228 Chandigarh – Varanasi Holi Special will operate between 22.02.2026 and 01.03.2026.\n\nNorth Eastern Railway\n\nNorth Eastern Railway will operate Holi Special trains connecting Lal Kuan, Mau, Rajkot, Amritsar, Gomti Nagar and Valsad. North Eastern Railway to run 12 Holi Special Train Services with 27 trips which are as follows:\n\nTrain No. 05046/05045 Lal Kuan–Rajkot–Lal Kuan Holi Special will operate between 27.02.2026 and 14.03.2026.\n\nTrain No. 05060/05059 Lal Kuan–Kolkata–Lal Kuan Holi Special will run on notified weekly days.\n\nTrain No. 05301/05302 Mau–Ambala Cantt–Mau Holi Special will operate between 05.03.2026 and 13.03.2026.\n\nTrain No. 05005/05006 Barhni–Amritsar–Barhni Holi Special will run between 04.03.2026 and 18.03.2026.\n\nTrain No. 05023/05024 Gomti Nagar–Khatipura–Gomti Nagar Holi Special will operate during early March.\n\nTrain No. 05017/05018 Mau–Valsad–Mau Holi Special will run between 28.02.2026 and 08.03.2026.\n\nNorth Frontier Railway\n\nNorth Frontier Railway will operate Holi Special trains connecting Northeast India with Bihar and North India. North Frontier Railway to run 10 Holi Special Train Services with 29 Trips which are as follows:\n\nTrain No. 05932/05931 Dibrugarh–Kolkata–Dibrugarh Holi Special will operate between 28.02.2026 and 09.03.2026.\n\nTrain No. 05633/05634 Narangi–Gorakhpur–Narangi Holi Special will run between 26.02.2026 and 12.03.2026.\n\nTrain No. 05736/05735 Katihar–Amritsar–Katihar Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 05974/05973 Dibrugarh–Jay Nagar–Dibrugarh Holi Special will run between 24.02.2026 and 17.03.2026.\n\nTrain No. 05627/05628 Agartala–Guwahati–Agartala Holi Special will operate between 25.02.2026 and 18.03.2026\n\nNorth Western Railway (NWR)\n\nWith the objective of facilitating smooth travel during the Holi festival, North Western Railway will operate several Holi Special trains from Rajasthan region including Jaipur, Jodhpur, Ajmer, Hisar, Bikaner and Bhagat Ki Kothi towards major destinations across North and West India. North Western Railway to run 14 Holi Special Train Services with 28 trips which are as follows:\n\nTrain No. 09705/09706 Jaipur–Bandra Terminus–Jaipur Holi Special will operate between 01.03.2026 and 16.03.2026 on weekly frequency.\n\nTrain No. 04829/04830 Jodhpur–Gorakhpur–Jodhpur Holi Special will run between 05.03.2026 and 13.03.2026.\n\nTrain No. 04715/04716 Bikaner–Sainagar Shirdi–Bikaner Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 04725/04726 Hisar–Kharki–Hisar Holi Special will run between 01.03.2026 and 16.03.2026.\n\nTrain No. 04727/04728 Hisar–Valsad–Hisar Holi Special will operate during early and mid-March.\n\nTrain No. 04827/04828 Bhagat Ki Kothi–Bandra Terminus–Bhagat Ki Kothi Holi Special will run between 01.03.2026 and 16.03.2026.\n\nTrain No. 09621/09622 Ajmer–Bandra Terminus–Ajmer Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nSouth Central Railway (SCR)\n\nSouth Central Railway will operate Holi Special trains from Charlapalli, Tirupati, Secunderabad and Chandrapura towards North, East and Northeast India. South Central Railway to run 16 Holi Special Train Services with 40 trips which are as follows:\n\nTrain No. 07092 Charlapalli–Danapur Holi Special will operate between 25.02.2026 and 09.03.2026.\n\nTrain No. 07119/07120 Charlapalli–Madar–Charlapalli Holi Special will run in early March.\n\nTrain No. 07512/07513 Charlapalli–Shalimar–Charlapalli Holi Special will operate between 26.02.2026 and 05.03.2026.\n\nTrain No. 07005/07006 Charlapalli–Raxaul–Charlapalli Holi Special will run between 28.02.2026 and 04.03.2026.\n\nTrain No. 07051/07052 Tirupati–Raxaul–Tirupati Holi Special will operate between 28.02.2026 and 10.03.2026.\n\nTrain No. 07046/07047 Secunderabad–Naharlagun–Secunderabad Holi Special will run between 27.02.2026 and 02.03.2026.\n\nTrain No. 07023/07024 Charlapalli–Hazrat Nizamuddin–Charlapalli Holi Special will operate between 28.02.2026 and 04.03.2026.\n\nTrain No. 07615/07616 Charlapalli–Tiruchchirappalli–Charlapalli Holi Special will run between 03.03.2026 and 17.03.2026.\n\nSouth Eastern Railway (SER)\n\nSouth Eastern Railway will operate Holi Special trains from Santragachi, Shalimar, Ranchi, Tatanagar, Hatia and Bhanjpur towards Eastern, Northern and Southern destinations. South Eastern Railway to run 28 Holi Special Train Services with 107 trips which are as follows:\n\nTrain No. 08185/08186 Hatia–Durg–Hatia Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 08007/08008 Shalimar–Bhanjpur–Shalimar Holi Special will run between 26.02.2026 and 17.03.2026.\n\nTrain No. 08011/08012 Bhanjpur–Puri–Bhanjpur Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 02839/02840 Shalimar–Puri–Shalimar Holi Special will run between 28.02.2026 and 16.03.2026.\n\nTrain No. 02847/02848 and 02897/02898 Santragachi–Digha–Santragachi Holi Specials will operate on weekends between 28.02.2026 and 16.03.2026.\n\nTrain No. 02863/02864 Santragachi–Yelahanka–Santragachi Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 02841/02842 Shalimar–MGR Chennai Central–Shalimar Holi Special will operate between 26.02.2026 and 15.03.2026.\n\nTrain No. 08611/08612 Santragachi–Ajmer–Santragachi Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 08629/08630 Ranchi–Gorakhpur–Ranchi Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 08181/08182 Tatanagar–Katihar–Tatanagar Holi Special will run between 02.03.2026 and 17.03.2026.\n\nTrain No. 08183/08184 Tatanagar–Buxar–Tatanagar Holi Special will operate between 03.03.2026 and 17.03.2026.\n\nTrain No. 08105/08106 Ranchi–Jhanjharpur–Ranchi Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 08109/08110 Santragachi–Darbhanga–Santragachi Holi Special will operate between 03.03.2026 and 17.03.2026.\n\nSouth East Central Railway (SECR)\n\nWith the objective of ensuring smooth and comfortable travel during Holi, South East Central Railway will operate Holi Special trains from Bilaspur, Durg and Gondia towards North and South India. South East Central Railway to run 10 Holi Special Train Services with 14 trips which are as follows:\n\nTrain No. 08263/08264 Bilaspur–Hyderabad–Bilaspur Holi Special will operate between 27.02.2026 and early March on notified days.\n\nTrain No. 08861/08862 Gondia–Patna–Gondia Holi Special will run between 02.03.2026 and 03.03.2026.\n\nTrain No. 08751/08752 Durg–Hazrat Nizamuddin–Durg Holi Special will operate between 01.03.2026 and 03.03.2026.\n\nTrain No. 08863/08864 and 08865/08866 Gondia–Chhapra–Gondia Holi Specials will run between 01.03.2026 and 04.03.2026.\n\nTrain No. 08753/08754 Durg–Madhubani–Durg Holi Special will operate between 01.03.2026 and 02.03.2026.\n\nSouthern Railway (SR)\n\nSouthern Railway will operate Holi Special trains connecting Chennai, Ernakulam, Thiruvananthapuram and Coimbatore with North and East India. Southern Railway to run 12 Holi Special Train Services with 31 trips which are as follows:\n\nTrain No. 06019/06020 MGR Chennai Central–Hazrat Nizamuddin–Chennai Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 06085/06086 Ernakulam–Muzaffarpur–Ernakulam Holi Special will run between 25.02.2026 and 18.03.2026.\n\nTrain No. 06039/06040 MGR Chennai Central–Barauni–Chennai Holi Special will operate between 02.03.2026 and mid-March.\n\nTrain No. 06077/06078 MGR Chennai Central–Santragachi–Chennai Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 06081/06082 Thiruvananthapuram North–Santragachi–Thiruvananthapuram North Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 06181/06182 Coimbatore–Jaipur–Coimbatore Holi Special will run between 01.03.2026 and 16.03.2026.\n\nSouth Western Railway (SWR)\n\nSouth Western Railway will operate Holi Special trains from SMVT Bengaluru, Yesvantpur and Mysuru to East and North India. South Western Railway to run 8 Holi Special Train Services with 21 trips which are as follows:\n\nTrain No. 06565/06566 SMVT Bengaluru–Malda Town–SMVT Bengaluru Holi Special will operate between 28.02.2026 and 16.03.2026.\n\nTrain No. 06563/06564 Yesvantpur–Dhanbad–Yesvantpur Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 06597/06598 Yesvantpur–Yog Nagari Rishikesh–Yesvantpur Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 06281/06282 Mysuru–Ajmer–Mysuru Holi Special will run between 01.03.2026 and 16.03.2026.\n\nWest Central Railway (WCR)\n\nWest Central Railway will operate Holi Special trains from Jabalpur, Kota, Rewa and Rani Kamlapati towards West, South and Northeast India. West Central Railway to run 18 Holi Special Train Services with 43 trips which are as follows:\n\nTrain No. 01665/01666 Rani Kamlapati–Agartala–Rani Kamlapati Holi Special will operate between 27.02.2026 and 14.03.2026.\n\nTrain No. 02131/02132 Pune–Jabalpur–Pune Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 02197/02198 Jabalpur–Coimbatore–Jabalpur Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 02133/02134 Jabalpur–Bandra Terminus–Jabalpur Holi Special will run between 06.03.2026 and 14.03.2026.\n\nTrain No. 02187/02188 Rewa–CSMT–Rewa Holi Special will operate between 26.02.2026 and 13.03.2026.\n\nTrain No. 09801/09802 Kota–Mathura–Kota Holi Special will run between 02.03.2026 and 03.03.2026.\n\nTrain No. 09803/09804 Kota–Radhikapur–Kota Holi Special will operate between 25.02.2026 and 05.03.2026.\n\nTrain No. 09805/09806 Kota–Jabalpur–Kota Holi Special will run between 01.03.2026 and 04.03.2026.\n\nWestern Railway (WR)\n\nWestern Railway will operate a large number of Holi Special trains from Mumbai Central, Ahmedabad, Vadodara, Valsad, Sabarmati and Udhna towards Bihar, Uttar Pradesh and Madhya Pradesh. Western Railway to run 32 Holi Special Train Services with 120 trips which are as follows:\n\nTrain No. 09185/09186 Mumbai Central–Kanpur Anwarganj–Mumbai Central Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 09189/09190 Mumbai Central–Katihar–Mumbai Central Holi Special will run between 28.02.2026 and 14.03.2026.\n\nTrain No. 09183/09184 Mumbai Central–Banaras–Mumbai Central Holi Special will operate between 03.03.2026 and 17.03.2026.\n\nTrain No. 09025/09026 Valsad–Danapur–Valsad Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 09111/09112 Vadodara–Gorakhpur–Vadodara Holi Special will operate between 02.03.2026 and 16.03.2026.\n\nTrain No. 09195/09196 Vadodara–Mau–Vadodara Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 09343/09344 Dr Ambedkar Nagar–Patna–Dr Ambedkar Nagar Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 09309/09310 Indore–Hazrat Nizamuddin–Indore Holi Special will run between 27.02.2026 and 16.03.2026.\n\nTrain No. 09425/09426 Sabarmati–Haridwar–Sabarmati Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 09031/09032 Udhna–Hasanpur–Udhna Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 09271/09272 Bhavnagar Terminus–Bikaner–Bhavnagar Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 09065/09066 Surat–Chhapra–Surat Holi Special will run between 25.02.2026 and 18.03.2026.\n\nTrain No. 09447/09448 Ahmedabad–Patna–Ahmedabad Holi Special will operate between 27.02.2026 and 13.03.2026.\n\nTrain No. 09465/09466 Ahmedabad–Darbhanga–Ahmedabad Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 09451/09452 Gandhidham–Bhagalpur–Gandhidham Holi Special will operate between 01.03.2026 and 08.03.2026.\n\nTrain No. 09085/09086 Mumbai Central–Indore–Mumbai Central Holi Special will run between 01.03.2026 and 08.03.2026.\n\nKonkan Railway (KR)\n\nKonkan Railway will operate Holi Special trains connecting Madgaon, Lokmanya Tilak Terminus, Chiplun and Diva. Konkan Railway to run 4 Holi Special Train Services with 20 trips which are as follows:\n\nTrain No. 01003/01004 Lokmanya Tilak Terminus–Madgaon–Lokmanya Tilak Terminus Holi Special will operate between 01.03.2026 and 08.03.2026.\n\nTrain No. 01159/01160 Diva–Chiplun–Diva Holi Special will run daily between 25.02.2026 and 08.03.2026.\n\nWith these extensive arrangements across zones, Indian Railways is ensuring enhanced connectivity, adequate accommodation and a smooth, safe and comfortable travel experience for passengers during Holi 2026.\n\nThe large-scale operation of special services reflects Indian Railways’ proactive planning to manage festive rush efficiently and minimize inconvenience to regular commuters. By strengthening connectivity between major cities, state capitals and regional centres, these measures are set to ease congestion and facilitate timely travel for lakhs of passengers celebrating the festival across the country.\n\n*****\n\nDharmendra Tewari/ Dr. Nayan Solanki/ Ritu Raj/ Manik Sharma\n\n(Release ID: 2232897)\n\nVisitor Counter : 170\n\n                                    Ministry of Railways\n\n                                          Indian Railways Begins to Operate 1,244 Holi Special Train Trips Across Zones to Ensure Smooth and Comfortable Festival Travel\n\nEast Central Railway to Operate Highest Number of Holi Specials with 275 Train Trips\nNorthern Railway to Run 204 Holi Special Train Trips\n\n                                          Posted On:\n                        25 FEB 2026 9:45PM by PIB Delhi\n\nIndian Railways has made elaborate arrangements to facilitate smooth, safe and comfortable travel for passengers during the upcoming Holi festival. To manage the anticipated surge in passenger traffic, 1244 Holi Special train trips to be operated across various Railway Zones for the Holi period from 25.02.2026 to 18.03.2026\n. The number may increase up to 1500 if more demand is observed.\n\nThese special services will connect major cities, state capitals and important regional centres across the country, ensuring confirmed accommodation and reducing congestion on regular trains.\n\nKey long-distance connections include Mumbai, Pune and Nagpur to destinations such as Danapur, Gorakhpur, Hazrat Nizamuddin, Samastipur and Barauni; Visakhapatnam, Puri and Bhubaneswar to Shalimar, Patna, Yesvantpur and Dhanbad; and major Bihar and Jharkhand hubs like Patna, Darbhanga, Saharsa and Dhanbad to New Delhi, Anand Vihar Terminal, Chandigarh and SMVT Bengaluru.\n\nEastern and Northern corridors will see enhanced connectivity between Howrah, Sealdah, Kolkata and Malda Town with Raxaul, Madhubani, Gorakhpur and Anand Vihar Terminal, while Delhi region stations will be linked extensively with Varanasi, Lucknow, Ayodhya Cantt, Haridwar, Amritsar and Katihar.\n\nFrom the South, special services will connect MGR Chennai Central, Ernakulam, Thiruvananthapuram North, Coimbatore, Secunderabad, Tirupati and SMVT Bengaluru with Patna, Barauni, Muzaffarpur, Santragachi, Ajmer, Jaipur and other northern and eastern centres. Western India, including Mumbai Central, Ahmedabad, Vadodara, Surat and Bandra Terminus, will have additional links to Kanpur, Katihar, Banaras, Gorakhpur, Darbhanga and Bhagalpur.\n\nCentral Railway\n\nWith the objective of providing smooth, safe and comfortable travel during the Holi festival, Central Railway will operate several Holi Special trains from major stations including Mumbai (CSMT & Lokmanya Tilak Terminus), Pune and Nagpur to key destinations across North and East India. Central Railway to run 20 Holi Special Train Services with 129 trips which are as follows:\n\nTrain No. 01469/01470 Pune–Nagpur–Pune Holi Special will operate between 25.02.2026 and 05.03.2026 with notified trips on Wednesdays and Thursdays.\n\nTrain No. 01073/01074 Lokmanya Tilak Terminus–Banaras–Lokmanya Tilak Terminus Holi Special will run between 25.02.2026 and 07.03.2026 on notified weekdays.\n\nTrain No. 01481/01482 Pune–Danapur–Pune Holi Special will operate between 27.02.2026 and 08.03.2026 on Mondays and Fridays (outward) and Wednesdays and Sundays (return).\n\nTrain No. 01431/01432 Pune–Ghazipur City–Pune Holi Special will run between 24.02.2026 and 08.03.2026 on notified weekly frequencies.\n\nTrain No. 01043/01044 Lokmanya Tilak Terminus–Samastipur–Lokmanya Tilak Terminus Holi Special will operate between 26.02.2026 and 05.03.2026.\n\nTrain No. 01491/01492 Pune–Hazrat Nizamuddin–Pune Holi Special will run between 27.02.2026 and 07.03.2026.\n\nTrain No. 01079/01080 CSMT–Gorakhpur–CSMT Holi Special will operate daily from 25.02.2026 to 08.03.2026.\n\nTrain No. 01415/01416 Pune–Gorakhpur–Pune Holi Special will also run daily between 25.02.2026 and 08.03.2026.\n\nTrain No. 01143/01144 Lokmanya Tilak Terminus–Danapur–Lokmanya Tilak Terminus Holi Special will operate daily during the notified period.\n\nTrain No. 01449/01450 Pune–Danapur–Pune Holi Special will also run daily from 25.02.2026 to 08.03.2026.\n\nEast Coast Railway\n\nEast Coast Railway will operate Holi Special trains from Visakhapatnam, Puri and Bhubaneswar towards Eastern and Southern destinations. East Coast Railway to run 8 Holi Special Train Services with 62 trips which are as follows:\n\nTrain No. 08507/08508 Visakhapatnam–Shalimar–Visakhapatnam Holi Special will operate between 03.03.2026 and 18.03.2026.\n\nTrain No. 08439/08440 Puri–Patna–Puri Holi Special will run between 28.02.2026 and 15.03.2026.\n\nTrain No. 02811/02812 Bhubaneswar–Yesvantpur–Bhubaneswar Holi Special will operate between 28.02.2026 and 16.03.2026.\n\nTrain No. 02831/02832 Bhubaneswar–Dhanbad–Bhubaneswar Holi Special will run daily from 25.02.2026 to 18.03.2026.\n\nEast Central Railway\n\nEast Central Railway will operate a large number of Holi Special trains connecting Bihar and Jharkhand with Delhi, Mumbai and South India. East Central Railway to run 50 Holi Special Train Services with 275 trips which are as follows:\n\nTrain No. 02563/02564 Barauni–New Delhi–Barauni Holi Special will run daily from 25.02.2026 to 18.03.2026.\n\nTrain No. 02569/02570 Darbhanga–New Delhi–Darbhanga Holi Special will also operate daily during the same period.\n\nTrain No. 05575/05576 Saharsa–Anand Vihar Terminal–Saharsa Holi Special will operate between 10.03.2026 and 18.03.2026.\n\nTrain No. 05579/05580 Purnea Court–Anand Vihar Terminal–Purnea Court Holi Special will run between 06.03.2026 and 18.03.2026 on multiple weekly frequencies.\n\nTrain No. 03293/03294 Patna–Old Delhi–Patna Holi Special will operate daily between 05.03.2026 and 16.03.2026.\n\nTrain No. 03697/03698 Sheikhpura–Anand Vihar Terminal–Sheikhpura Holi Special will run between 27.02.2026 and 15.03.2026.\n\nTrain No. 02397/02398 Sheikhpura–Anand Vihar Terminal–Sheikhpura Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 03639/03640 Gaya–Old Delhi–Gaya Holi Special will run between 06.03.2026 and 13.03.2026.\n\nTrain No. 03309/03310 Dhanbad–Old Delhi–Dhanbad Holi Special will operate between 03.03.2026 and 18.03.2026.\n\nTrain No. 03311/03312 Dhanbad–Chandigarh–Dhanbad Holi Special will run between 06.03.2026 and 19.03.2026.\n\nTrain No. 03379/03380 Dhanbad–Lokmanya Tilak Terminus–Dhanbad Holi Special will operate between 10.03.2026 and 19.03.2026.\n\nTrain No. 03677/03678 Dhanbad–Gorakhpur–Dhanbad Holi Special will run between 08.03.2026 and 16.03.2026.\n\nTrain No. 03257/03258 Danapur–Anand Vihar Terminal–Danapur Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 03223/03224 Rajgir–Haridwar–Rajgir Holi Special will run between 06.03.2026 and 14.03.2026.\n\nTrain No. 03221/03222 Rajgir–Anand Vihar Terminal–Rajgir Holi Special will operate between 09.03.2026 and 18.03.2026.\n\nTrain No. 03251/03252 Danapur–SMVT Bengaluru–Danapur Holi Special will run daily between 25.02.2026 and 18.03.2026.\n\nTrain No. 03225/03226 Danapur–Charlapalli–Danapur Holi Special will operate between 05.03.2026 and 15.03.2026.\n\nTrain No. 03253/07855-56 Patna–Charlapalli–Patna Holi Special will run between 09.03.2026 and 16.03.2026.\n\nTrain No. 02023/02024 Patna–Howrah–Patna Holi Special will operate between 08.03.2026 and 15.03.2026.\n\nTrain No. 05557/05558 Raxaul–Lokmanya Tilak Terminus–Raxaul Holi Special will run between 07.03.2026 and 15.03.2026.\n\nTrain No. 05585/05586 Saharsa–Lokmanya Tilak Terminus–Saharsa Holi Special will operate between 10.03.2026 and 19.03.2026.\n\nTrain No. 05219/05220 Muzaffarpur–Anand Vihar Terminal–Muzaffarpur Holi Special will run between 06.03.2026 and 15.03.2026.\n\nEastern Railway\n\nWith the objective of managing Holi festival rush, Eastern Railway will operate several Holi Special trains from Howrah, Sealdah, Kolkata, Malda Town, Dankuni and Asansol towards Bihar, Uttar Pradesh and Delhi region. Eastern Railway to run 22 Holi Special Train Services with 48 trips which are as follows:\n\nTrain No. 03043/03044 Howrah–Raxaul–Howrah Holi Special will operate between 28.02.2026 and 15.03.2026 on notified days.\n\nTrain No. 03045/03046 Howrah–Raxaul–Howrah Holi Special will run between 01.03.2026 and 03.03.2026.\n\nTrain No. 03183/03184 Sealdah–Madhubani–Sealdah Holi Special will operate between 28.02.2026 and 08.03.2026.\n\nTrain No. 03185/03186 & 03187/03188 Kolkata–Madhubani–Kolkata Holi Specials will run between 27.02.2026 and 04.03.2026.\n\nTrain No. 03525/03526 and 03527/03528 Asansol–Gorakhpur–Asansol Holi Specials will operate between 27.02.2026 and 03.03.2026.\n\nTrain No. 03009/03010 Dankuni–Anand Vihar Terminal–Dankuni Holi Special will run between 28.02.2026 and 08.03.2026.\n\nTrain No. 03435/03436 Malda Town–Anand Vihar Terminal–Malda Town Holi Special will operate between 02.03.2026 and 17.03.2026.\n\nTrain No. 03007/03008 Howrah–Kharagpur–Howrah Holi Special will run between 25.02.2026 and 13.03.2026.\n\nTrain No. 03129/03130 Kolkata–New Jalpaiguri–Kolkata Holi Special will operate between 28.02.2026 and 01.03.2026.\n\nTrain No. 03101/03102 Sealdah–Malda Town–Sealdah Holi Special will run between 27.02.2026 and 21.03.2026.\n\nTrain No. 03417/03418 Malda Town–Udhna–Malda Town Holi Special will operate between 28.02.2026 and 23.03.2026.\n\nNorthern Railway\n\nNorthern Railway will operate extensive Holi Special trains connecting Delhi region with Uttar Pradesh, Bihar, Uttarakhand and Punjab. Northern Railway to run 48 Holi Special Train Services with 204 trips which are as follows:\n\nTrain No. 04209/04210 New Delhi–Varanasi–New Delhi Holi Special will operate five days a week between 25.02.2026 and early March.\n\nTrain No. 04213/04214 Ayodhya Cantt–Anand Vihar Terminal–Ayodhya Cantt Holi Special will run tri-weekly.\n\nTrain No. 04227/04228 Varanasi–Chandigarh–Varanasi Holi Special will operate bi-weekly.\n\nTrain No. 04203/04204 Lucknow–New Delhi–Lucknow Holi Special will run weekly.\n\nTrain No. 04052/04051 New Delhi–Howrah–New Delhi Holi Special will operate daily between 25.02.2026 and 08.03.2026.\n\nTrain No. 04014/04013 New Delhi–Barauni–New Delhi Holi Special will run daily during the notified period.\n\nTrain No. 04070/04069 Anand Vihar Terminal–Lucknow–Anand Vihar Holi Special will operate daily.\n\nTrain No. 04060/04059 Anand Vihar Terminal–Saharsa–Anand Vihar Holi Special will run daily between 25.02.2026 and 07.03.2026.\n\nTrain No. 04010/04009 Delhi–Sitamarhi–Delhi Holi Special will operate between 25.02.2026 and 06.03.2026.\n\nTrain No. 04066/04065 Anand Vihar Terminal–Puri–Anand Vihar Holi Special will run daily.\n\nTrain No. 04614/04613 Amritsar–Katihar–Amritsar Holi Special will operate weekly during early March.\n\nTrain No. 04652/04651 Amritsar–Jay Nagar–Amritsar Holi Special will run bi-weekly.\n\nTrain No. 04616/04615 Firozpur Cantt–Danapur–Firozpur Cantt Holi Special will operate weekly.\n\nTrain No. 04610/04609 Amritsar–Mansi–Amritsar Holi Special will run bi-weekly.\n\nTrain No. 04302/04301 Haridwar–Muzaffarpur–Haridwar Holi Special will operate tri-weekly.\n\nTrain No. 04312/04311 Yog Nagari Rishikesh–Kolkata–Yog Nagari Rishikesh Holi Special will run tri-weekly.\n\nTrain No. 04514/04513 Chandigarh–Gorakhpur–Chandigarh Holi Special will operate weekly.\n\nTrain No. 04002/04001 New Delhi–Dadar Western–New Delhi Holi Special will run bi-weekly.\n\nTrain No. 04226/04225 Varanasi–Lokmanya Tilak Terminus–Varanasi Holi Special will operate bi-weekly.\n\nTrain No. 04212/04211 Sultanpur–Lokmanya Tilak Terminus–Sultanpur Holi Special will run bi-weekly.\n\nTrain No. 04414/04413 Hazrat Nizamuddin–Mathura–Hazrat Nizamuddin Holi Special will operate daily.\n\nTrain No. 04412/04411 Tilak Bridge–Bareilly–Tilak Bridge Holi Special will run daily.\n\nNorth Central Railway\n\nWith the objective of managing the additional passenger rush during the Holi festival, North Central Railway has notified several Holi Special train services connecting Uttar Pradesh with Maharashtra and other key destinations. North Central Railway to run 16  Holi Special Train Services with 46 trips which are as follows:\n\nTrain No. 04212 Sultanpur – Lokmanya Tilak Terminus Holi Special will operate on 26.02.2026 and 02.03.2026.\n\nTrain No. 04211 Lokmanya Tilak Terminus – Sultanpur Holi Special will operate on 27.02.2026 and 03.03.2026.\n\nTrain No. 04226 Varanasi – Lokmanya Tilak Terminus Holi Special will operate on 25.02.2026 and 01.03.2026.\n\nTrain No. 04225 Lokmanya Tilak Terminus – Varanasi Holi Special will operate on 26.02.2026 and 02.03.2026.\n\nTrain No. 04203 Lucknow – New Delhi Holi Special will operate on 23.02.2026 and 02.03.2026.\n\nTrain No. 04204 New Delhi – Lucknow Holi Special will operate on 23.02.2026 and 02.03.2026.\n\nTrain No. 04209 Varanasi – Delhi Holi Special will operate between 22.02.2026 and 06.03.2026.\n\nTrain No. 04210 Delhi – Varanasi Holi Special will operate between 23.02.2026 and 07.03.2026.\n\nTrain No. 04227 Varanasi – Chandigarh Holi Special will operate between 21.02.2026 and 28.02.2026.\n\nTrain No. 04228 Chandigarh – Varanasi Holi Special will operate between 22.02.2026 and 01.03.2026.\n\nNorth Eastern Railway\n\nNorth Eastern Railway will operate Holi Special trains connecting Lal Kuan, Mau, Rajkot, Amritsar, Gomti Nagar and Valsad. North Eastern Railway to run 12 Holi Special Train Services with 27 trips which are as follows:\n\nTrain No. 05046/05045 Lal Kuan–Rajkot–Lal Kuan Holi Special will operate between 27.02.2026 and 14.03.2026.\n\nTrain No. 05060/05059 Lal Kuan–Kolkata–Lal Kuan Holi Special will run on notified weekly days.\n\nTrain No. 05301/05302 Mau–Ambala Cantt–Mau Holi Special will operate between 05.03.2026 and 13.03.2026.\n\nTrain No. 05005/05006 Barhni–Amritsar–Barhni Holi Special will run between 04.03.2026 and 18.03.2026.\n\nTrain No. 05023/05024 Gomti Nagar–Khatipura–Gomti Nagar Holi Special will operate during early March.\n\nTrain No. 05017/05018 Mau–Valsad–Mau Holi Special will run between 28.02.2026 and 08.03.2026.\n\nNorth Frontier Railway\n\nNorth Frontier Railway will operate Holi Special trains connecting Northeast India with Bihar and North India. North Frontier Railway to run 10 Holi Special Train Services with 29 Trips which are as follows:\n\nTrain No. 05932/05931 Dibrugarh–Kolkata–Dibrugarh Holi Special will operate between 28.02.2026 and 09.03.2026.\n\nTrain No. 05633/05634 Narangi–Gorakhpur–Narangi Holi Special will run between 26.02.2026 and 12.03.2026.\n\nTrain No. 05736/05735 Katihar–Amritsar–Katihar Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 05974/05973 Dibrugarh–Jay Nagar–Dibrugarh Holi Special will run between 24.02.2026 and 17.03.2026.\n\nTrain No. 05627/05628 Agartala–Guwahati–Agartala Holi Special will operate between 25.02.2026 and 18.03.2026\n\nNorth Western Railway (NWR)\n\nWith the objective of facilitating smooth travel during the Holi festival, North Western Railway will operate several Holi Special trains from Rajasthan region including Jaipur, Jodhpur, Ajmer, Hisar, Bikaner and Bhagat Ki Kothi towards major destinations across North and West India. North Western Railway to run 14 Holi Special Train Services with 28 trips which are as follows:\n\nTrain No. 09705/09706 Jaipur–Bandra Terminus–Jaipur Holi Special will operate between 01.03.2026 and 16.03.2026 on weekly frequency.\n\nTrain No. 04829/04830 Jodhpur–Gorakhpur–Jodhpur Holi Special will run between 05.03.2026 and 13.03.2026.\n\nTrain No. 04715/04716 Bikaner–Sainagar Shirdi–Bikaner Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 04725/04726 Hisar–Kharki–Hisar Holi Special will run between 01.03.2026 and 16.03.2026.\n\nTrain No. 04727/04728 Hisar–Valsad–Hisar Holi Special will operate during early and mid-March.\n\nTrain No. 04827/04828 Bhagat Ki Kothi–Bandra Terminus–Bhagat Ki Kothi Holi Special will run between 01.03.2026 and 16.03.2026.\n\nTrain No. 09621/09622 Ajmer–Bandra Terminus–Ajmer Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nSouth Central Railway (SCR)\n\nSouth Central Railway will operate Holi Special trains from Charlapalli, Tirupati, Secunderabad and Chandrapura towards North, East and Northeast India. South Central Railway to run 16 Holi Special Train Services with 40 trips which are as follows:\n\nTrain No. 07092 Charlapalli–Danapur Holi Special will operate between 25.02.2026 and 09.03.2026.\n\nTrain No. 07119/07120 Charlapalli–Madar–Charlapalli Holi Special will run in early March.\n\nTrain No. 07512/07513 Charlapalli–Shalimar–Charlapalli Holi Special will operate between 26.02.2026 and 05.03.2026.\n\nTrain No. 07005/07006 Charlapalli–Raxaul–Charlapalli Holi Special will run between 28.02.2026 and 04.03.2026.\n\nTrain No. 07051/07052 Tirupati–Raxaul–Tirupati Holi Special will operate between 28.02.2026 and 10.03.2026.\n\nTrain No. 07046/07047 Secunderabad–Naharlagun–Secunderabad Holi Special will run between 27.02.2026 and 02.03.2026.\n\nTrain No. 07023/07024 Charlapalli–Hazrat Nizamuddin–Charlapalli Holi Special will operate between 28.02.2026 and 04.03.2026.\n\nTrain No. 07615/07616 Charlapalli–Tiruchchirappalli–Charlapalli Holi Special will run between 03.03.2026 and 17.03.2026.\n\nSouth Eastern Railway (SER)\n\nSouth Eastern Railway will operate Holi Special trains from Santragachi, Shalimar, Ranchi, Tatanagar, Hatia and Bhanjpur towards Eastern, Northern and Southern destinations. South Eastern Railway to run 28 Holi Special Train Services with 107 trips which are as follows:\n\nTrain No. 08185/08186 Hatia–Durg–Hatia Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 08007/08008 Shalimar–Bhanjpur–Shalimar Holi Special will run between 26.02.2026 and 17.03.2026.\n\nTrain No. 08011/08012 Bhanjpur–Puri–Bhanjpur Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 02839/02840 Shalimar–Puri–Shalimar Holi Special will run between 28.02.2026 and 16.03.2026.\n\nTrain No. 02847/02848 and 02897/02898 Santragachi–Digha–Santragachi Holi Specials will operate on weekends between 28.02.2026 and 16.03.2026.\n\nTrain No. 02863/02864 Santragachi–Yelahanka–Santragachi Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 02841/02842 Shalimar–MGR Chennai Central–Shalimar Holi Special will operate between 26.02.2026 and 15.03.2026.\n\nTrain No. 08611/08612 Santragachi–Ajmer–Santragachi Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 08629/08630 Ranchi–Gorakhpur–Ranchi Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 08181/08182 Tatanagar–Katihar–Tatanagar Holi Special will run between 02.03.2026 and 17.03.2026.\n\nTrain No. 08183/08184 Tatanagar–Buxar–Tatanagar Holi Special will operate between 03.03.2026 and 17.03.2026.\n\nTrain No. 08105/08106 Ranchi–Jhanjharpur–Ranchi Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 08109/08110 Santragachi–Darbhanga–Santragachi Holi Special will operate between 03.03.2026 and 17.03.2026.\n\nSouth East Central Railway (SECR)\n\nWith the objective of ensuring smooth and comfortable travel during Holi, South East Central Railway will operate Holi Special trains from Bilaspur, Durg and Gondia towards North and South India. South East Central Railway to run 10 Holi Special Train Services with 14 trips which are as follows:\n\nTrain No. 08263/08264 Bilaspur–Hyderabad–Bilaspur Holi Special will operate between 27.02.2026 and early March on notified days.\n\nTrain No. 08861/08862 Gondia–Patna–Gondia Holi Special will run between 02.03.2026 and 03.03.2026.\n\nTrain No. 08751/08752 Durg–Hazrat Nizamuddin–Durg Holi Special will operate between 01.03.2026 and 03.03.2026.\n\nTrain No. 08863/08864 and 08865/08866 Gondia–Chhapra–Gondia Holi Specials will run between 01.03.2026 and 04.03.2026.\n\nTrain No. 08753/08754 Durg–Madhubani–Durg Holi Special will operate between 01.03.2026 and 02.03.2026.\n\nSouthern Railway (SR)\n\nSouthern Railway will operate Holi Special trains connecting Chennai, Ernakulam, Thiruvananthapuram and Coimbatore with North and East India. Southern Railway to run 12 Holi Special Train Services with 31 trips which are as follows:\n\nTrain No. 06019/06020 MGR Chennai Central–Hazrat Nizamuddin–Chennai Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 06085/06086 Ernakulam–Muzaffarpur–Ernakulam Holi Special will run between 25.02.2026 and 18.03.2026.\n\nTrain No. 06039/06040 MGR Chennai Central–Barauni–Chennai Holi Special will operate between 02.03.2026 and mid-March.\n\nTrain No. 06077/06078 MGR Chennai Central–Santragachi–Chennai Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 06081/06082 Thiruvananthapuram North–Santragachi–Thiruvananthapuram North Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 06181/06182 Coimbatore–Jaipur–Coimbatore Holi Special will run between 01.03.2026 and 16.03.2026.\n\nSouth Western Railway (SWR)\n\nSouth Western Railway will operate Holi Special trains from SMVT Bengaluru, Yesvantpur and Mysuru to East and North India. South Western Railway to run 8 Holi Special Train Services with 21 trips which are as follows:\n\nTrain No. 06565/06566 SMVT Bengaluru–Malda Town–SMVT Bengaluru Holi Special will operate between 28.02.2026 and 16.03.2026.\n\nTrain No. 06563/06564 Yesvantpur–Dhanbad–Yesvantpur Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 06597/06598 Yesvantpur–Yog Nagari Rishikesh–Yesvantpur Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 06281/06282 Mysuru–Ajmer–Mysuru Holi Special will run between 01.03.2026 and 16.03.2026.\n\nWest Central Railway (WCR)\n\nWest Central Railway will operate Holi Special trains from Jabalpur, Kota, Rewa and Rani Kamlapati towards West, South and Northeast India. West Central Railway to run 18 Holi Special Train Services with 43 trips which are as follows:\n\nTrain No. 01665/01666 Rani Kamlapati–Agartala–Rani Kamlapati Holi Special will operate between 27.02.2026 and 14.03.2026.\n\nTrain No. 02131/02132 Pune–Jabalpur–Pune Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 02197/02198 Jabalpur–Coimbatore–Jabalpur Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 02133/02134 Jabalpur–Bandra Terminus–Jabalpur Holi Special will run between 06.03.2026 and 14.03.2026.\n\nTrain No. 02187/02188 Rewa–CSMT–Rewa Holi Special will operate between 26.02.2026 and 13.03.2026.\n\nTrain No. 09801/09802 Kota–Mathura–Kota Holi Special will run between 02.03.2026 and 03.03.2026.\n\nTrain No. 09803/09804 Kota–Radhikapur–Kota Holi Special will operate between 25.02.2026 and 05.03.2026.\n\nTrain No. 09805/09806 Kota–Jabalpur–Kota Holi Special will run between 01.03.2026 and 04.03.2026.\n\nWestern Railway (WR)\n\nWestern Railway will operate a large number of Holi Special trains from Mumbai Central, Ahmedabad, Vadodara, Valsad, Sabarmati and Udhna towards Bihar, Uttar Pradesh and Madhya Pradesh. Western Railway to run 32 Holi Special Train Services with 120 trips which are as follows:\n\nTrain No. 09185/09186 Mumbai Central–Kanpur Anwarganj–Mumbai Central Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 09189/09190 Mumbai Central–Katihar–Mumbai Central Holi Special will run between 28.02.2026 and 14.03.2026.\n\nTrain No. 09183/09184 Mumbai Central–Banaras–Mumbai Central Holi Special will operate between 03.03.2026 and 17.03.2026.\n\nTrain No. 09025/09026 Valsad–Danapur–Valsad Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 09111/09112 Vadodara–Gorakhpur–Vadodara Holi Special will operate between 02.03.2026 and 16.03.2026.\n\nTrain No. 09195/09196 Vadodara–Mau–Vadodara Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 09343/09344 Dr Ambedkar Nagar–Patna–Dr Ambedkar Nagar Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 09309/09310 Indore–Hazrat Nizamuddin–Indore Holi Special will run between 27.02.2026 and 16.03.2026.\n\nTrain No. 09425/09426 Sabarmati–Haridwar–Sabarmati Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 09031/09032 Udhna–Hasanpur–Udhna Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 09271/09272 Bhavnagar Terminus–Bikaner–Bhavnagar Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 09065/09066 Surat–Chhapra–Surat Holi Special will run between 25.02.2026 and 18.03.2026.\n\nTrain No. 09447/09448 Ahmedabad–Patna–Ahmedabad Holi Special will operate between 27.02.2026 and 13.03.2026.\n\nTrain No. 09465/09466 Ahmedabad–Darbhanga–Ahmedabad Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 09451/09452 Gandhidham–Bhagalpur–Gandhidham Holi Special will operate between 01.03.2026 and 08.03.2026.\n\nTrain No. 09085/09086 Mumbai Central–Indore–Mumbai Central Holi Special will run between 01.03.2026 and 08.03.2026.\n\nKonkan Railway (KR)\n\nKonkan Railway will operate Holi Special trains connecting Madgaon, Lokmanya Tilak Terminus, Chiplun and Diva. Konkan Railway to run 4 Holi Special Train Services with 20 trips which are as follows:\n\nTrain No. 01003/01004 Lokmanya Tilak Terminus–Madgaon–Lokmanya Tilak Terminus Holi Special will operate between 01.03.2026 and 08.03.2026.\n\nTrain No. 01159/01160 Diva–Chiplun–Diva Holi Special will run daily between 25.02.2026 and 08.03.2026.\n\nWith these extensive arrangements across zones, Indian Railways is ensuring enhanced connectivity, adequate accommodation and a smooth, safe and comfortable travel experience for passengers during Holi 2026.\n\nThe large-scale operation of special services reflects Indian Railways’ proactive planning to manage festive rush efficiently and minimize inconvenience to regular commuters. By strengthening connectivity between major cities, state capitals and regional centres, these measures are set to ease congestion and facilitate timely travel for lakhs of passengers celebrating the festival across the country.\n\n*****\n\nDharmendra Tewari/ Dr. Nayan Solanki/ Ritu Raj/ Manik Sharma\n\n                                          (Release ID: 2232897)",
  "fetched_at_utc": "2026-02-25T17:43:12.301433+00:00"
}